Revit 2026 API
RebarSpliceUtils.SpliceRebar Method
Overload List
Name | Description
SpliceRebar(Document, ElementId, RebarSpliceOptions, IList<RebarSpliceGeometry>)
SpliceRebar(Document, ElementId, RebarSpliceOptions, Line, ElementId) |  Splice a Rebar with a line.
SpliceRebar(Document, ElementId, RebarSpliceOptions, Line, XYZ) |  Splice a rebar with a line.
Top
See Also
Reference
RebarSpliceUtils Class
Autodesk.Revit.DB.Structure Namespace